<template>
  <div class="product-school">
    <div class="l-default">
      <SProgramStart />
      <SProgramCpaLine />
      <SProgramPeople :dataObject="forWhom" />
      <SProgramCommand :dataObject="schoolAtHome" />
      <SProgramSkills />
      <SProgramAdvantages />
      <SProgramTeachers :dataObject="process" />
      <SProgramTeachers :dataObject="teachers" />
      <SProgramForm formClass="bg--red" />
      <SProgramQuestions :dataObject="program" />
      <SProgramStudies :dataObject="studies" />
      <SProgramCommand :dataObject="command" />
      <SProgramDiploma />
      <SProgramReviews />
      <SProgramPrice formClass="bg--blue" />
      <SProgramQuestions :dataObject="questions" />
    </div>
  </div>
</template>

<script>
import SProgramStart from '~/components/product_school/s_program_start/s_program_start';
import SProgramCpaLine from '~/components/product_school/s_program_cpa_line/s_program_cpa_line';
import SProgramPeople from '~/components/product_school/s_program_people/s_program_people';
import SProgramSkills from '~/components/product_school/s_program_skills/s_program_skills';
import SProgramAdvantages from '~/components/product_school/s_program_advantages/s_program_advantages';
import SProgramTeachers from '~/components/product_school/s_program_teachers/s_program_teachers';
import SProgramForm from '~/components/product_school/s_program_form/s_program_form';
import SProgramQuestions from '~/components/product_school/s_program_questions/s_program_questions';
import SProgramStudies from '~/components/product_school/s_program_studies/s_program_studies';
import SProgramCommand from '~/components/product_school/s_program_command/s_program_command';
import SProgramDiploma from '~/components/product_school/s_program_diploma/s_program_diploma';
import SProgramReviews from '~/components/product_school/s_program_reviews/s_program_reviews';
import SProgramPrice from '~/components/product_school/s_program_price/s_program_price';

export default {
  name: 'product_school',

  components: {
    SProgramStart,
    SProgramCpaLine,
    SProgramPeople,
    SProgramSkills,
    SProgramAdvantages,
    SProgramTeachers,
    SProgramForm,
    SProgramQuestions,
    SProgramStudies,
    SProgramCommand,
    SProgramDiploma,
    SProgramReviews,
    SProgramPrice,
  },

  data() {
    return {
      forWhom: {
        title: 'Для кого подойдёт <span>онлайн-школа</span>',
        list: [
          {
            title: 'Для семейного обучения',
            // eslint-disable-next-line max-len
            text: 'Онлайн-школа подойдет вам, если вашему ребёнку некомфортно в школе или вас не устраивает качество образования в доступных территориально школах',
            image: '/school/for-whom/1.jpg',
          },
          {
            title: 'Для тех, кто часто пропускает школу',
            // eslint-disable-next-line max-len
            text: 'Если ваш ребенок занимается спортом, музыкой или другим профессиональным увлечением и часто пропускает школу',
            image: '/school/for-whom/2.jpg',
          },
          {
            title: 'Для проживающих заграницей',
            // eslint-disable-next-line max-len
            text: 'Если вы живете за рубежом, но планируете вернуться на родину и продолжить обучение здесь. Если школьник — гражданин другой страны',
            image: '/school/for-whom/3.jpg',
          },
        ],
        swiperOptions: {
          slidesPerView: 'auto',
          spaceBetween: 20,
          loop: false,
          height: 'auto',
          direction: 'horizontal',
          resistance: true,
          resistanceRatio: 0,
          breakpoints: {
            576: {
              spaceBetween: 16,
              slidesPerView: 'auto',
              direction: 'horizontal',
            },
            768: {
              spaceBetween: 24,
            },
            992: {
              slidesPerView: 3,
              direction: 'horizontal',
            },
          },
        },
      },
      process: {
        // eslint-disable-next-line max-len
        title: 'Как устроен <span>образовательный процесс</span>',
        list: [
          {
            name: 'Обучение',
            description:
              // eslint-disable-next-line max-len
              'Проверенные и актуальные программы обучения. Преподаватель ведёт занятие в режиме реального времени. Подготовка к поступлению в лучшие вузы страны и сдаче ОГЭ.',
            image: '/school/process/1.jpg',
          },
          {
            name: 'Работа на уроке',
            description:
              // eslint-disable-next-line max-len
              'Совместная с классом работа над задачами, вопросами и материалом. Возможность в любой момент задать вопрос учителю.',
            image: '/school/process/2.jpg',
          },
          {
            name: 'Поддержка',
            description:
              // eslint-disable-next-line max-len
              'Сохраненная запись вебинара - всегда можно вернуться и посмотреть. По каждому предмету оказывает поддержку наставник, которому можно задать вопросы по учебному материалу и ДЗ',
            image: '/school/process/3.jpg',
          },
          {
            name: 'Самостоятельная работа',
            description:
              // eslint-disable-next-line max-len
              'Совместная с классом работа над задачами, вопросами и материалом. Возможность в любой момент задать вопрос учителю.',
            image: '/school/process/3.jpg',
          },
        ],
        swiperOptions: {
          slidesPerView: 'auto',
          spaceBetween: 20,
          loop: false,
          height: 'auto',
          direction: 'horizontal',
          resistance: true,
          resistanceRatio: 0,
          breakpoints: {
            576: {
              spaceBetween: 16,
              slidesPerView: 'auto',
              direction: 'horizontal',
            },
            768: {
              spaceBetween: 24,
            },
            992: {
              slidesPerView: 4,
              direction: 'horizontal',
            },
          },
        },
      },
      teachers: {
        title: '<span>Преподаватели</span> школы',
        list: [
          {
            name: 'Меринова Диана Ивановна',
            description:
              // eslint-disable-next-line max-len
              'Эксперт ЕГЭ по русскому языку. Опыт преподавания в школе более 5 лет и более 3 лет на онлайн-платформах',
            image: '/school/teachers/1.jpg',
          },
          {
            name: 'Осипов Никита Юрьевич',
            description:
              // eslint-disable-next-line max-len
              'Призер математических олимпиад «Физтех» и «Звезда»; Автор более 10 электронных курсов по подготовке к ЕГЭ и ОГЭ',
            image: '/school/teachers/2.jpg',
          },
          {
            name: 'Модебадзе Мардон Ираклиевич',
            description:
              // eslint-disable-next-line max-len
              'Преподаватель лицея ГУ-ВШЭ. Эксперт ЕГЭ/ОГЭ. Окончил магистратуру факультета права Высшей школы экономики',
            image: '/school/teachers/3.jpg',
          },
          {
            name: 'Андрей Борю',
            description:
              // eslint-disable-next-line max-len
              'В разработке более 12 лет, изначально программировал на php, потом освоил Golang, java, python. Последние несколько лет активно занимается devops',
            image: '/school/teachers/4.jpg',
          },
        ],
        swiperOptions: {
          slidesPerView: 'auto',
          spaceBetween: 20,
          loop: false,
          height: 'auto',
          direction: 'horizontal',
          resistance: true,
          resistanceRatio: 0,
          breakpoints: {
            576: {
              spaceBetween: 16,
              slidesPerView: 'auto',
              direction: 'horizontal',
            },
            768: {
              spaceBetween: 24,
            },
            992: {
              slidesPerView: 4,
              direction: 'horizontal',
            },
          },
        },
      },
      program: {
        title: 'Программа классов',
        list: [
          {
            title: '5 класс',
            // eslint-disable-next-line max-len
            text: 'Это новый этап для ученика и его родителей. В программе появляются новые предметы: история, биология, география, литература, информатика. Теперь учитель будет не один — их будет сразу несколько. У каждого ученика есть персональный куратор, который выполняет роль классного руководителя и всегда на связи. С нами переход в среднюю школу будет комфортным и интересным!',
            isActive: true,
            timetable: {
              title: 'Пример расписания',
              time: {
                title: 'Время',
                items: [
                  '09.00-10.00',
                  '10.00-11.00',
                  '11.00-12.00',
                  '12.00-13.00',
                  '13.00-14.00',
                  '14.00-15.00',
                  '15.00-16.00',
                ],
              },
              days: [
                {
                  title: 'Понедельник',
                  subjects: ['История', 'Русский язык', 'Математика', 'ИЗО', 'Английский язык', 'Литература', ''],
                },
                {
                  title: 'Вторник',
                  subjects: ['Русский язык', 'Музыка', 'География', 'Математика', 'Технология', 'Технология', ''],
                },
                {
                  title: 'Среда',
                  subjects: [
                    'Английский язык',
                    'Математика',
                    'Информатика',
                    'Русский язык',
                    'Испанский язык',
                    'Физическая культура',
                    '',
                  ],
                },
                {
                  title: 'Четверг',
                  subjects: [
                    'Биология',
                    'Русский язык',
                    'Обществознание',
                    'Математика',
                    'Английский язык',
                    'Литература',
                    '',
                  ],
                },
                {
                  title: 'Пятница',
                  subjects: ['', 'Русский язык', 'Математика', 'История', 'Физическая культура', 'Испанский язык', ''],
                },
              ],
            },
          },
          {
            title: '6 класс',
            // eslint-disable-next-line max-len
            text: '6-й класс — плавное продолжение пятого. В этом учебном году программа почти не изменится, зато вас ждёт более глубокое изучение предметов. Занятий по одним дисциплинам станет больше, а по другим — меньше. Профильные преподаватели и ваш личный куратор всегда ответят на любые вопросы, которые могут возникнуть по учёбе. Спокойно и уверенно идем дальше!',
            isActive: false,
            timetable: {
              title: 'Пример расписания',
              time: {
                title: 'Время',
                items: [
                  '09.00-10.00',
                  '10.00-11.00',
                  '11.00-12.00',
                  '12.00-13.00',
                  '13.00-14.00',
                  '14.00-15.00',
                  '15.00-16.00',
                ],
              },
              days: [
                {
                  title: 'Понедельник',
                  subjects: ['Биология', 'ИЗО', 'Русский язык', 'Английский язык', 'Математика', '', ''],
                },
                {
                  title: 'Вторник',
                  subjects: ['', 'Русский язык', 'Математика', 'Литература', 'История', 'Музыка', ''],
                },
                {
                  title: 'Среда',
                  subjects: [
                    'Испанский язык',
                    'Физическая культура',
                    'Английский язык',
                    'Информатика',
                    'Математика',
                    'Русский язык',
                    'Обществознание',
                  ],
                },
                {
                  title: 'Четверг',
                  subjects: [
                    'Английский язык',
                    'Технология',
                    'Математика',
                    'Русский язык',
                    'Технология',
                    'История',
                    '',
                  ],
                },
                {
                  title: 'Пятница',
                  subjects: [
                    'Испанский язык',
                    'Физическая культура',
                    'Русский язык',
                    'География',
                    'Математика',
                    'Литература',
                    '',
                  ],
                },
              ],
            },
          },
          {
            title: '7 класс',
            // eslint-disable-next-line max-len
            text: '7-й класс – середина школьного пути. Ученики – уже «взрослые дети». У них становится больше ответственности. Вводятся новые и более сложные дисциплины: алгебра, геометрия, физика. Программа идёт дальше, по одним предметам занятий станет чуть больше (по биологии и географии), а по другим — чуть меньше (по русскому языку). Пройдем этот путь вместе!',
            isActive: false,
            timetable: {
              title: 'Пример расписания',
              time: {
                title: 'Время',
                items: [
                  '09.00-10.00',
                  '10.00-11.00',
                  '11.00-12.00',
                  '12.00-13.00',
                  '13.00-14.00',
                  '14.00-15.00',
                  '15.00-16.00',
                ],
              },
              days: [
                {
                  title: 'Понедельник',
                  subjects: ['', 'Алгебра', 'История', 'Геометрия', 'География', 'Английский язык', ''],
                },
                {
                  title: 'Вторник',
                  subjects: ['Музыка', 'Русский язык', 'Русский язык', 'Обществознание', 'Алгебра', 'Информатика', ''],
                },
                {
                  title: 'Среда',
                  subjects: ['История', 'Испанский язык', 'Биология', 'Литература', 'Алгебра', 'Физика', 'Информатика'],
                },
                {
                  title: 'Четверг',
                  subjects: [
                    'Физическая культура',
                    'Геометрия',
                    'Русский язык',
                    'Русский язык',
                    'Английский язык',
                    'Английский язык',
                    '',
                  ],
                },
                {
                  title: 'Пятница',
                  subjects: [
                    'География',
                    'Испанский язык',
                    'Физическая культура',
                    'Физика',
                    'Литература',
                    'Технология',
                    'Технология',
                  ],
                },
              ],
            },
          },
          {
            title: '8 класс',
            // eslint-disable-next-line max-len
            text: 'В 8-м классе в образовательную программу будут введены два новых предмета: химия и ОБЖ. Что касается остальных дисциплин, то изменения коснутся только количества уроков в неделю — занятий станет немного больше.Обратите внимание: не за горами сдача ОГЭ в 9-м классе, поэтому самое время плавно вводить в программу занятия по подготовке к экзаменам: русскому, математике и двум предметам на выбор. Дорогу осилит идущий! А мы всегда поможем и замотивируем.',
            isActive: false,
            timetable: {
              title: 'Пример расписания',
              time: {
                title: 'Время',
                items: [
                  '09.00-10.00',
                  '10.00-11.00',
                  '11.00-12.00',
                  '12.00-13.00',
                  '13.00-14.00',
                  '14.00-15.00',
                  '15.00-16.00',
                ],
              },
              days: [
                {
                  title: 'Понедельник',
                  subjects: [
                    'География',
                    'Физическая культура',
                    'Информатика',
                    'Русский язык',
                    'Русский язык',
                    'Геометрия',
                    'История',
                  ],
                },
                {
                  title: 'Вторник',
                  subjects: [
                    'ОБЖ',
                    'Алгебра',
                    'Физика',
                    'Английский язык',
                    'Английский язык',
                    'Литература',
                    'География',
                  ],
                },
                {
                  title: 'Среда',
                  subjects: [
                    'Физическая культура',
                    'Русский язык',
                    'Геометрия',
                    'Химия',
                    'История',
                    'Испанский язык',
                    '',
                  ],
                },
                {
                  title: 'Четверг',
                  subjects: ['Искусство', 'Алгебра', 'Информатика', 'Биология', 'Литература', 'Технология', ''],
                },
                {
                  title: 'Пятница',
                  subjects: [
                    'Английский язык',
                    'Алгебра',
                    'Физика',
                    'Химия',
                    'Обществознание',
                    'Биология',
                    'Испанский язык',
                  ],
                },
              ],
            },
          },
          {
            title: '9 класс',
            // eslint-disable-next-line max-len
            text: '9-й класс — один из самых важных за всё время обучения в школе. Что нас ждет? Предметов становится меньше, зато больше времени на основательную подготовку к ОГЭ по русскому, математике и двум предметам на выбор. В дополнение к базовой школьной программе мы предоставляем бесплатные курсы подготовки к ОГЭ по нужным предметам. В течение учебного года мы несколько раз проводим объективный срез знаний — пробные онлайн-экзамены по вариантам этого года от ФИПИ. После успешной сдачи экзаменов выдается аттестат об основном общем образовании государственного образца. ',
            isActive: false,
            timetable: {
              title: 'Пример расписания',
              time: {
                title: 'Время',
                items: [
                  '09.00-10.00',
                  '10.00-11.00',
                  '11.00-12.00',
                  '12.00-13.00',
                  '13.00-14.00',
                  '14.00-15.00',
                  '15.00-16.00',
                ],
              },
              days: [
                {
                  title: 'Понедельник',
                  subjects: [
                    'Биолог. / Физи.',
                    'История',
                    'Русский язык',
                    'Русский язык',
                    'Физика',
                    'Искусство',
                    'ОБЖ',
                  ],
                },
                {
                  title: 'Вторник',
                  subjects: [
                    'Литература',
                    'Английский язык',
                    'Английский язык',
                    'Инфморатика',
                    'География',
                    'История',
                    '',
                  ],
                },
                {
                  title: 'Среда',
                  subjects: ['Геометрия', 'Биология', 'Алгебра', 'Алгебра', 'Химия', 'Литература', ''],
                },
                {
                  title: 'Четверг',
                  subjects: ['Геометрия', 'Русский язык', 'Химия', 'Физика', 'Информатика', '', ''],
                },
                {
                  title: 'Пятница',
                  subjects: [
                    'Биология',
                    'Литература',
                    'Алгебра',
                    'Английский язык',
                    'География',
                    'Физическая культура',
                    'Обществознание',
                  ],
                },
              ],
            },
          },
          {
            title: '10 класс',
            // eslint-disable-next-line max-len
            text: '10-й класс — новый этап и лучшее время, чтобы начать подготовку к главному школьному экзамену — ЕГЭ. Очень важно, чтобы у ребенка было представление о том, в какой вуз он хочет поступить. С этим выбором ему готовы помочь наши преподаватели и психолог.У онлайн-школы «Синергия» — социально-экономический профиль, а значит дополнительными дисциплинами будут: «Право», «Экономика», «Техника личной презентации», «Тайм-менеджмент», «Основы бизнеса» и «Психология делового общения». В этом году не будет экзаменов, но подготовка будет серьезная, и расслабляться не стоит. Желаем успехов в учебе!',
            isActive: false,
            timetable: {
              title: 'Пример расписания',
              time: {
                title: 'Время',
                items: [
                  '09.00-10.00',
                  '10.00-11.00',
                  '11.00-12.00',
                  '12.00-13.00',
                  '13.00-14.00',
                  '14.00-15.00',
                  '15.00-16.00',
                ],
              },
              days: [
                {
                  title: 'Понедельник',
                  subjects: ['', 'Литература', '', 'Алгебра', 'Право', 'Естествознание', 'Английский язык'],
                },
                {
                  title: 'Вторник',
                  subjects: ['', 'Информатика', 'Русский язык', 'Русский язык', 'Геометрия', 'ОБЖ', ''],
                },
                {
                  title: 'Среда',
                  subjects: [
                    'Литература',
                    'Литература',
                    'История',
                    'Геометрия',
                    'Английский язык',
                    'Английский язык',
                    '',
                  ],
                },
                {
                  title: 'Четверг',
                  subjects: [
                    'Испанский язык',
                    'Испанский язык',
                    'Физическая культура',
                    'Экономика',
                    'Обществознание',
                    'Естествознание',
                    'Астрономия',
                  ],
                },
                {
                  title: 'Пятница',
                  subjects: [
                    'История',
                    'Экономика',
                    'Естествознание',
                    'Алгебра',
                    'Алгебра',
                    'Право',
                    'Физическая культура',
                  ],
                },
              ],
            },
          },
          {
            title: '11 класс',
            // eslint-disable-next-line max-len
            text: '11-й класс — последняя и важнейшая ступень образовательного процесса. Наградой за её успешное преодоление станет аттестат государственного образца о среднем общем образовании.Учащимся предстоит сдать ЕГЭ по четырём дисциплинам: русскому, математике и двум предметам на выбор. В дополнение к базовой школьной программе мы предоставляем бесплатные курсы подготовки к ЕГЭ по нужным предметам. В течение учебного года мы несколько раз проводим объективный срез знаний — пробные онлайн-экзамены по вариантам этого года от ФИПИ.Программа в 11-м классе похожа на 10-й, добавится лишь один новый предмет — астрономия. Продолжаем освоение школьной программы и усиленно готовимся к поступлению. С нами вы поступите в вуз вашей мечты!',
            isActive: false,
            timetable: {
              title: 'Пример расписания',
              time: {
                title: 'Время',
                items: [
                  '09.00-10.00',
                  '10.00-11.00',
                  '11.00-12.00',
                  '12.00-13.00',
                  '13.00-14.00',
                  '14.00-15.00',
                  '15.00-16.00',
                ],
              },
              days: [
                {
                  title: 'Понедельник',
                  subjects: ['Литература', 'Естествознание', 'ОБЖ', 'Информатика', 'Русский язык', 'Право', ''],
                },
                {
                  title: 'Вторник',
                  subjects: [
                    'История',
                    'Обществознание',
                    'Алгебра',
                    'Алгебра',
                    'Русский язык',
                    'Физическая культура',
                    '',
                  ],
                },
                {
                  title: 'Среда',
                  subjects: [
                    'Естествознание',
                    'Английский язык',
                    'Английский язык',
                    'Право',
                    'Литература',
                    '',
                    'Испанский язык',
                  ],
                },
                {
                  title: 'Четверг',
                  subjects: [
                    'История',
                    'Обществознание',
                    'Алгебра',
                    'Алгебра',
                    'Естествознание',
                    'Физическая культура',
                    'Экономика',
                  ],
                },
                {
                  title: 'Пятница',
                  subjects: ['Литература', 'Английский язык', 'Экономика', 'Геометрия', 'Испанский язык', '', ''],
                },
              ],
            },
          },
        ],
      },
      studies: {
        title: 'Форма <span>обучения</span>',
        subtitle:
          // eslint-disable-next-line max-len
          'Наша школа предлагает две формы обучения. Проконсультируйтесь с нами - мы расскажем об их особенностях и различиях.',
        items: [
          {
            imgTop: 'pink',
            title: 'Семейная',
            // eslint-disable-next-line max-len
            list: [
              'Доступно для 5, 6, 7, 8, 10 классов',
              'Полностью дистанционное обучение и аттестация',
              'Ответственность за обучение на родителях',
              'Аттестационный лист об окончания класса',
              'Образовательный процесс, соответствующий ФГОС, и аккредитованые программы обучения',
              'Помощь с переходом на семейную форму обучения',
              'Зачисление в школу на время прохождени промежуточной аттестации',
            ],
            message:
              'Для получения аттестата и сдачи ОГЭ/ЕГЭ необходим переход на заочную форму обучения в 9 и 11 классе',
          },
          {
            imgTop: 'blue',
            title: 'Заочная',
            // eslint-disable-next-line max-len
            list: [
              'Доступно для 5-11 классов',
              'Выдача аттестата государственного образца',
              'Зачисление в контингент школы',
              'Вступительное тестирование по основным предметам',
              // eslint-disable-next-line max-len
              'Образовательный процесс, соответствующий ФГОС,  и аккредитованые программы обучения',
              'Полный цикл подготовки к ОГЭ/ЕГЭ',
              // eslint-disable-next-line max-len
              'Прохождение МЦКО и ВПР,  текущая и промежуточная аттестации',
            ],
            // eslint-disable-next-line max-len
            message: 'Для зачисления и начала обучения необходимо предоставить полный пакет документов!',
          },
        ],
      },
      questions: {
        title: 'Часто задаваемые вопросы',
        list: [
          {
            title: 'Как проходит обучение?',
            // eslint-disable-next-line max-len
            text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания1',
            isActive: true,
          },
          {
            title: 'Что делать, если я не могу учиться Online?',
            // eslint-disable-next-line max-len
            text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания2',
            isActive: false,
          },
          {
            title: 'Что делать, если у меня проблема или срочный вопрос?',
            // eslint-disable-next-line max-len
            text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания3',
            isActive: false,
          },
          {
            title: 'Я никогда не работал с кодом. У меня получится?',
            // eslint-disable-next-line max-len
            text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания4',
            isActive: false,
          },
          {
            title: 'Сколько часов в неделю мне нужно будет уделять учёбе?',
            // eslint-disable-next-line max-len
            text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания5',
            isActive: false,
          },
          {
            title: 'А я точно трудоустроюсь?',
            // eslint-disable-next-line max-len
            text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания6',
            isActive: false,
          },
        ],
      },
      command: {
        isMobile: false,
        title: 'Команда <span>поддержки</span>',
        subtitle:
          // eslint-disable-next-line max-len
          'Образовательный процесс ученика сопровождает команда специалистов, которые следят за тем, чтобы обучение проходило эффективно и комфортно как для школьников, так и для их родителей.',
        items: [
          {
            icon: '',
            title: 'Куратор',
            // eslint-disable-next-line max-len
            text: 'Отвечает на технические и административные вопросы, предоставляет родителям ежемесячную отчетность по успеваемости и посещаемости, выполняет роль классного руководителя.',
          },
          {
            icon: '',
            title: 'Наставник',
            // eslint-disable-next-line max-len
            text: 'Помогает влиться в учебный процесс, разобраться с домашними заданиями и учебными материалами, а также поддерживает у ребёнка интерес к своему предмету на протяжении всего учебного года.',
          },
          {
            icon: '',
            title: 'Модератор',
            // eslint-disable-next-line max-len
            text: 'Отвечает на вопросы и следит за порядком во время вебинара. Помогает ученику разобраться с возникающими техническими проблемами и трудностями.',
          },
          {
            icon: '',
            title: 'Психолог',
            // eslint-disable-next-line max-len
            text: 'Помогает ученикам преодолеть трудности процесса обучения и определиться с будущей профессией и вузом. На постоянной основе дает родителям обратную связь по результатам общения с ребенком.',
          },
        ],
      },
      schoolAtHome: {
        isMobile: false,
        title: '<span>Школа</span> у вас дома',
        subtitle: '',
        items: [
          {
            icon: '',
            title: 'Онлайн-уроки',
            // eslint-disable-next-line max-len
            text: 'Проходят в формате вебинаров и остаются в записи. Живое общение учителя с классом',
          },
          {
            icon: '',
            title: 'Лучшие преподаватели',
            // eslint-disable-next-line max-len
            text: 'Преподаватели лучших школ и вузов России. Методическая поддержка ФИПИ и университета «Синергия»',
          },
          {
            icon: '',
            title: 'Мониторинг обучения',
            // eslint-disable-next-line max-len
            text: 'Отчеты успеваемости для детей и родителей. Электронный журнал и дневник',
          },
          {
            icon: '',
            title: 'Команда поддержки',
            // eslint-disable-next-line max-len
            text: 'Персональный куратор, наставники, модераторы, психолог',
          },
          {
            icon: '',
            title: 'Поступление в ВУЗ мечты',
            // eslint-disable-next-line max-len
            text: 'Эффективный путь к поступлению в лучшие вузы, полный цикл подготовки ',
          },
          {
            icon: '',
            title: 'Гибкий график',
            // eslint-disable-next-line max-len
            text: 'Учитесь когда вам удобно. Записи прошедших уроков и контент доступны 24/7',
          },
        ],
      },
    };
  },
};
</script>
