<template>
  <section class="s-contats-note">
    <h2 class="s-contats-note__title a-font_xxl" v-html="title"></h2>
    <p class="s-contats-note__p a-font_l-m" v-html="paragraph"></p>
  </section>
</template>

<script>
import './s_contats_note.scss';

export default {
  name: 'SContactsMain',

  data() {
    return {
      title: 'Правообладателям изображений, которые использованы на сайте',
      paragraph: `Если вы правообладатель изображения, которое без вашего ведома было использовано на сайте, 
        или мы каким-либо образом нарушили ваши авторские права, просим вас связатьсяс нами во избежание 
        случаев нарушения авторских прав. Мы немедленно уберем из сети Интернет неправомерно размещенные 
        на нашем сайте изображения. Мы уважаем авторское право и не размещаем на сайте сознательно изображения, 
        нарушающие чьи-то права. Просим вас не тратить время и деньги на юристов, просто напишите нам, и мы немедленно 
        уберем с сайта ваши изображения.`,
    };
  },
};
</script>
