<template>
  <SProgramContent :title="title" :direction="direction" :items="items" />
</template>

<script>
import { SProgramContent } from '@cwespb/synergyui';
import './s_program_questions.scss';

export default {
  name: 's_program_questions',

  components: {
    SProgramContent,
  },

  data() {
    return {
      title: 'Часто задаваемые вопросы',
      direction: 'down',
      items: [
        {
          id: 1,
          title: 'Как проходит обучение?',
          isActive: true,
          listItems: [
            {
              id: 1,
              type: 'text',
              text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
            },
          ],
        },
        {
          id: 2,
          title: 'Что делать, если я не могу учиться Online?',
          isActive: false,
          listItems: [
            {
              id: 1,
              type: 'text',
              text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
            },
          ],
        },
        {
          id: 3,
          title: 'Что делать, если у меня проблема или срочный вопрос?',
          isActive: false,
          listItems: [
            {
              id: 1,
              type: 'text',
              text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
            },
          ],
        },
        {
          id: 4,
          title: 'Я никогда не работал с кодом. У меня получится?',
          isActive: false,
          listItems: [
            {
              id: 1,
              type: 'text',
              text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
            },
          ],
        },
        {
          id: 5,
          title: 'Сколько часов в неделю мне нужно будет уделять учёбе?',
          isActive: false,
          listItems: [
            {
              id: 1,
              type: 'text',
              text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
            },
          ],
        },
        {
          id: 6,
          title: 'А я точно трудоустроюсь?',
          isActive: false,
          listItems: [
            {
              id: 1,
              type: 'text',
              text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
            },
          ],
        },
      ],
    };
  },
};
</script>
