<template>
  <div class="l-default">
    <SProgramQuestions :title="title" :items="items" />
  </div>
</template>

<script>
import { SProgramQuestions } from '@cwespb/synergyui';
import './s_program_questions.scss';

export default {
  name: 's_program_questions',

  components: {
    SProgramQuestions,
  },

  data() {
    return {
      title: 'Часто задаваемые вопросы',
      items: [
        {
          id: 1,
          isActive: true,
          title: 'Как проходит обучение?',
          text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помиощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
        },
        {
          id: 2,
          isActive: false,
          title: 'Что делать, если я не могу учиться Online?',
          text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помиощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
        },
        {
          id: 3,
          isActive: false,
          title: 'Что делать, если у меня проблема или срочный вопрос?',
          text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помиощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
        },
        {
          id: 4,
          isActive: false,
          title: 'Я никогда не работал с кодом, у меня получится?',
          text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помиощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
        },
        {
          id: 5,
          isActive: false,
          title: 'Сколько часов в неделю мне нужно будет уделять учёбе?',
          text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помиощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
        },
        {
          id: 6,
          isActive: false,
          title: 'А я точно трудоустроюсь?',
          text: 'Для тех, кто не смог вовремя присутствовать на уроке, мы записываем каждое занятие. Видеозаписи всегда доступны в разделе обучения. Также к каждому уроку мы разработали методички, с помиощью которых можно лучше подготовиться к занятиям и получить дополнительные знания',
        },
      ],
    };
  },
};
</script>
